LOVE LANGUAGES PERSONAL PROFILE
-------------------------------
A: WORDS OF AFFIRMATION 
B: QUALITY TIME 
C: RECEIVING GIFTS 
D: ACTS OF SERVICE 
E: PHYSICAL TOUCH
Which love language received the highest score? This is your primary love language. If point totals for two love languages are equal, you are “bilingual” and have two primary love languages. And, if you have a secondary love language, or one that is close in score to your primary love language, this means that both expressions of love are important to you. The highest possible score for any single love language is 12.

================================================

1 It’s more meaningful to me when… 
A I receive a loving note/text/email for no special reason from my loved one. 
E my partner and I hug. 

2 It’s more meaningful to me when… 
B I can spend alone time with my partner - just the two of us. 
D my partner does something practical to help me out. 

3 It’s more meaningful to me when… 
C my partner gives me a little gift as a token of our love for each other. 
B I get to spend uninterrupted leisure time with my partner. 

4 It’s more meaningful to me when… 
D my partner unexpectedly does something for me like ﬁ lling my car or doing the laundry. 
E my partner and I touch. 

5 It’s more meaningful to me when… 
E my partner puts his/her arm around me when we’re in public. 
C my partner surprises me with a gift. 

6 It’s more meaningful to me when… 
B I’m around my partner, even if we’re not really doing anything. 
E I hold hands with my partner. 

7 It’s more meaningful to me when… 
C my partner gives me a gift. 
A I hear “I love you” from my partner. 

8 It’s more meaningful to me when… 
E I sit close to my partner. 
A I am complimented by my loved one for no apparent reason.

9 It’s more meaningful to me when… 
B I get the chance to just “hang out” with my partner. 
C I unexpectedly get small gifts from my partner. 

10 It’s more meaningful to me when… 
A I hear my partner tell me, “I’m proud of you.” 
D my partner helps me with a task. 

11 It’s more meaningful to me when… 
B I get to do things with my partner. 
A I hear supportive words from my partner. 

12 It’s more meaningful to me when… 
D my partner does things for me instead of just talking about doing nice things. 
E I feel connected to my partner through a hug. 

13 It’s more meaningful to me when… 
A I hear praise from my partner. 
C my partner gives me something that shows he/she was really thinking about me. 

14 It’s more meaningful to me when… 
B I’m able to just be around my partner. 
E I get a back rub or massage from my partner. 

15 It’s more meaningful to me when… 
A my partner reacts positively to something I’ve accomplished. 
D my partner does something for me that I know they don’t particularly enjoy. 

16 It’s more meaningful to me when… 
E my partner and I kiss frequently. 
B I sense my partner is showing interest in the things I care about.

17 It’s more meaningful to me when… 
D my partner works on special projects with me that I have to complete. 
C my partner gives me an exciting gift. 

18 It’s more meaningful to me when… 
A I’m complimented by my partner on my appearance. 
B my partner takes the time to listen to me and really understand my feelings. 

19 It’s more meaningful to me when… 
E my partner and I share non-sexual touch in public. 
D my partner offers to run errands for me. 

20 It’s more meaningful to me when… 
D my partner does a bit more than his/her normal share of the responsibilities we share (around the house, work-related, etc).
C I get a gift that I know my partner put thought into choosing. 

21 It’s more meaningful to me when… 
B my partner doesn’t check his/her phone while we’re talking. 
D my partner goes out of their way to do something that relieves pressure on me. 

22 It’s more meaningful to me when… 
C I can look forward to a holiday because of a gift I anticipate receiving. 
A I hear the words,  “I appreciate you” from my partner. 

23 It’s more meaningful to me when… 
C my partner brings me a little gift after he/she has been traveling without me. 
D my partner takes care of something I’m responsible to do but I feel too stressed to do at the time.

24 It’s more meaningful to me when… 
B my partner doesn’t interrupt me while I’m talking. 
C gift giving is an important part of our relationship. 

25 It’s more meaningful to me when… 
D my partner helps me out when he/she knows I’m already tired. 
B I get to go somewhere while spending time with my partner. 

26 It’s more meaningful to me when… 
E my partner and I are physically intimate. 
C my partner gives me a little gift that he/she picked up in the course of their normal day. 

27 It’s more meaningful to me when… 
A my partner says something encouraging to me. 
B I get to spend time in a shared activity or hobby with my partner. 

28 It’s more meaningful to me when… 
C my partner surprises me with a small token of their appreciation. 
E my partner and I touch a lot during the normal course of the day. 

29 It’s more meaningful to me when… 
D my partner helps me out - especially if I know they’re already busy. 
A I hear my partner speciﬁ cally tell me, “I appreciate you.” 

30 It’s more meaningful to me when… 
E my partner and I embrace after we’ve been apart for a while. 
A I hear my partner say how much I mean to him/her.